<h1>Форма и Цвет храма.</h1>
<h2>Заголовок второго уровня. Вторая строка</h2>
<p>
	Храм был высечен из цельного куска белой мраморной скалы с вкраплениями жил
	большого количества разных пород. Уникальные сочетания материалов добавляли
	храму природного величия. Тщательная полировка заставляла блестеть эти
	минералы и руды. Много путников пало, пытаясь ощутить могущество этого
	вечного здания. Было очевидно, что создать красоту такого масштаба без
	помощи божества простым архитекторам было просто невозможно.
</p>
<figure>
	<img src="square.jpg" alt="" />
	<figcaption>
		Небольшое вертикальное изображение, 123468Небольшое вертикальное
		изображение, 123468Небольшое вертикальное изображение, 123468Небольшое
		вертикальное изображение, 123468
	</figcaption>
</figure>

<style>
	h1 {
		margin: 240px 0 64px;
	}
	h2 {
		margin-bottom: 32px;
	}
	p {
		margin-bottom: 32px;
	}
	img {
		max-height: 320px;
		margin-bottom: 16px;
	}
	figcaption {
		margin-bottom: 32px;
	}
</style>
